src/Catalogs/ВариантыДампов/ВариантыДампов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыДампов</name>
  <predefined>
    <items>
      <name>ДляЗавершенияБезОбразованияДампа</name>
      <description>Используется для обозначения процесса, завершившегося без образования дампа</description>
    </items>
  </predefined>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДампа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДополнительноСохраняемыхДампов</name>
    <comment>Количество дампов, которые необходимо сохранить дополнительно к уже собранным</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОшибки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процесс</name>
    <type>
      <types>EnumRef.Процессы</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатыИРекомендации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Смещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияВариантаДампа</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИзменилось</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьВсеДампы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СохраненныеДампы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеФайла</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбнаружения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ЧислоПроблемПлатформы/ЧислоПроблемПлатформы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЧислоПроблемПлатформы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЧислоПроблем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

src/InformationRegisters/НовыеПроблемы/НовыеПроблемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НовыеПроблемы</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Решена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВариантДампа</name>
    <type>
      <types>CatalogRef.ВариантыДампов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СостоянияВариантаДампа/СостоянияВариантаДампа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВариантаДампа</name>
  <enumValues>
    <name>НеИсправлен</name>
  </enumValues>
  <enumValues>
    <name>Исправлен</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВариантыДампов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.СостояниеИзменилось = Общий.ЭтоНовыйОбъект(ЭтотОбъект) 
		ИЛИ (ЭтотОбъект.Состояние <> ЭтотОбъект.Ссылка.Состояние);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.СостояниеИзменилось Тогда
		
		ПодправитьЧислоПроблем(ЭтотОбъект.Состояние = Перечисления.СостоянияВариантаДампа.Исправлен);
		
	КонецЕсли;
КонецПроцедуры

Процедура ПодправитьЧислоПроблем(ПроблемаРешена)
	
	ТекущаяДата = ТекущаяДата();
	
	АктуальноеЧислоПроблем = РегистрыСведений.ЧислоПроблемПлатформы.ПолучитьПоследнее()["ЧислоПроблем"];
	СчетчикПроблем = РегистрыСведений.ЧислоПроблемПлатформы.СоздатьМенеджерЗаписи();
	СчетчикПроблем.ЧислоПроблем = АктуальноеЧислоПроблем + ?(ПроблемаРешена, -1, 1);
	СчетчикПроблем.Период = ТекущаяДата;
	СчетчикПроблем.Записать();
	
	ЗаписьОПроблеме = РегистрыСведений.НовыеПроблемы.СоздатьМенеджерЗаписи();
	ЗаписьОПроблеме.ВариантДампа = ЭтотОбъект.Ссылка;
	ЗаписьОПроблеме.Период = ТекущаяДата;
	ЗаписьОПроблеме.Решена = ПроблемаРешена;
	ЗаписьОПроблеме.Записать();
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	ПодправитьЧислоПроблем(Истина);
	
КонецПроцедуры

#КонецЕсли
